---
kind: other
id: Properties.T:Autodesk.Revit.DB.Mechanical.MechanicalFitting
source: html/d89ae52b-235b-3121-f327-b292a54df387.htm
---
# MechanicalFitting Properties

Retrieves the Connector Manager from this MEPModel.